url_shortener/URLShortener/app/models/shortened_url.rb

    def self.create(user, long_url)
        ShortenedUrl.create!(
            long_url: long_url,
            short_url: ShortenedUrl.random_code(long_url),
            user_id: user.id
        )
---
INSERT INTO "shortened_urls" ("long_url", "short_url", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["long_url", "microsoft.com"], ["short_url", "QhMSa-vwi9-dYsG418yIew"], ["user_id", 1], ["created_at", "2020-11-25 22:27:42.799341"], ["updated_at", "2020-11-25 22:27:42.799341"]]